
# За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
# Input:
# n = 700
# m = 750
# Output:
# 2

# n = int(input('Enter n: '))
# m = int(input('Enter m: '))
# s = (m + (n - 1)) // n
# print(s)


# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32

# class_1 = int(input('1--> '))
# class_2 = int(input('2--> '))
# class_3 = int(input('3--> '))
# class_1 += 1
# class_2 += 1
# class_3 += 1
# print(f'Нам нужно парт: {(class_1//2) + (class_2//2) + (class_3//2)}')


# Дано натуральное число. Требуется определить, является ли год с данным номером високосным. 
# Если год является високосным, то выведите YES, иначе выведите NO. Напомним, что в соответствии 
# с григорианским календарем, год является високосным, если его номер кратен 4, но не кратен 100, 
# а также если он кратен 400.
# Input: 2016
# Output: YES

year = int(input())
if ((year%4==0 and year%100!=0) or year%400==0):
    print("YES")
else:
    print("NO")

# or

year = int(input())
print('YES') if ((year%4 == 0) and (year%100 != 0)) or (year%400 == 0) else print("NO")
