# Задача 10. На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты
# вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть.

n = int(input("Введите число монеток: "))
reshka = 0
orel = 0
from random import randint
for i in range(n):
    x = randint(0, 1)
    if x == 0:
        orel += 1
    else:
        reshka += 1
    print(x)
if orel < reshka:
    print(f'Переверните  монеты с орла на решку, их меньше всего: {orel}')
elif orel == reshka:
    print(f'Количество орлов и решек одинаково, по: {orel}')
else:
    print(f'Переверните  монеты с решки на орла, их меньше всего: {reshka}')
