# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент 
# к заданному числу X. Пользователь в первой строке вводит натуральное число 
# N – количество элементов в массиве. В последующих  строках записаны N целых чисел Ai. 
# Последняя строка содержит число X
# *Пример:*
# 5
# 1 2 3 4 5
# 6
# -> 5

N = int(input('Ввести количество чисел в массиве А: '))
a=[int(input('Ввести каждое число массива на новой строке: ')) for i in range(N)]
x=int(input('Заданное число Х: '))
b=[abs(a[i]-x) for i in range(len(a))]
print(f'--> {a[b.index(min(b))]}')
